In [16]:
import pandas as pd
pd.__version__

'2.2.3'

In [17]:
dict_new={
    "name":['Gaurav','Navin Sir','Harsh Bhaiya','Sushil'],
    "marks":[96,98,85,88],
    "city":['Gaya','Bengaluru','Jodhpur','Bikaner']
    
}

In [18]:
dframe=pd.DataFrame(dict_new)

In [19]:
dframe

           name  marks       city
0        Gaurav     96       Gaya
1     Navin Sir     98  Bengaluru
2  Harsh Bhaiya     85    Jodhpur
3        Sushil     88    Bikaner

In [20]:
#we can convert this data frame to any file format. Let's say we want to convert it into .csv
#index means row in general and column ko column hi bolte hain.
dframe.to_csv('office.csv',index=False)

In [21]:
dframe.head(2)

        name  marks       city
0     Gaurav     96       Gaya
1  Navin Sir     98  Bengaluru

In [22]:
dframe.tail(2)

           name  marks     city
2  Harsh Bhaiya     85  Jodhpur
3        Sushil     88  Bikaner

In [23]:
#it does a numerical analysis
dframe.describe()

           marks
count   4.000000
mean   91.750000
std     6.238322
min    85.000000
25%    87.250000
50%    92.000000
75%    96.500000
max    98.000000

In [24]:
#to read a csv file
flight_details=pd.read_csv('flight_details.csv');

In [25]:
flight_details

  flight_no  price destination
0    GS1234   9600        Gaya
1    NR1234   9800   Bengaluru
2    HB1234   8500     Jodhpur
3    SR1234   8800     Bikaner

In [26]:
flight_details['price']

0    9600
1    9800
2    8500
3    8800
Name: price, dtype: int64

In [27]:
flight_details['price'][2]=10000

C:\Users\gshar\AppData\Local\Temp\ipykernel_11464\3132491848.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  flight_details['price'][2]=10000

In [28]:
flight_details

  flight_no  price destination
0    GS1234   9600        Gaya
1    NR1234   9800   Bengaluru
2    HB1234  10000     Jodhpur
3    SR1234   8800     Bikaner

### to change the index of data frame

In [29]:
flight_details.index=['first','second','third','fourth']

In [30]:
flight_details

       flight_no  price destination
first     GS1234   9600        Gaya
second    NR1234   9800   Bengaluru
third     HB1234  10000     Jodhpur
fourth    SR1234   8800     Bikaner

In [ ]:
#### Pandas is an opensource data analysis library written in Python. leverages the power and speed of numpy to make data analysis and preprocessing easy for data scientist. It provides rich and highlu robust data operations.